Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: Where the manufacturer’s instructions do not specify the location and minimum size of field-fabricated access openings, an opening not less than 12 inches by 12 inches (305 mm by 305 mm) shall be installed to provide access to the circulation pump.
fr_ca: Lorsque les directives du fabricant ne précisent pas l’emplacement et la taille minimale des ouvertures d’accès fabriquées sur place, une ouverture d’au moins 12 po sur 12 po [305 mm sur 305 mm] doit être installée pour permettre l’accès à la pompe de circulation.

source: Where the operable parts on an inactive leaf of a double leaf doorway are located more than 48 inches (1220 mm) or less than 15 inches (380 mm) above the floor, the active leaf shall provide the clearance required by Section 1104.5.2.1.
fr_ca: Lorsque les parties manœuvrables d'un vantail inactif d'une ouverture de porte à deux vantaux sont situées à plus de 48 po [1220 mm] ou à moins de 15 po [380 mm] au-dessus du sol, le vantail actif doit fournir le dégagement exigé par la section 1104.5.2.1.

source: Where the public entrance includes a vestibule, at least one door into and one door out of the vestibule shall meet the requirements of this section.
fr_ca: Lorsque l’entrée publique comporte un vestibule, au moins une porte donnant sur le vestibule et une porte donnant hors du vestibule doivent être conformes aux exigences de la présente section.

source: Where the risk analysis determines a need for mass notification, an approved mass notification system shall be provided in accordance with the findings of the risk analysis.
fr_ca: Lorsque l’analyse des risques détermine qu’une notification de masse est nécessaire, un système de notification de masse approuvé doit être prévu conformément aux conclusions de l’analyse des risques.

source: Where the room is for individual use and a clear floor space complying with Section 305.3 is provided within the room beyond the arc of the door swing, the door shall not be required to comply with this section.
fr_ca: Lorsque la pièce est destinée à un usage individuel et qu'une surface de plancher dégagée conforme à l'article 305.3 est prévue dans la pièce au-delà de l'arc d'ouverture de la porte, celle-ci n'est pas tenue de se conformer au présent article.

source: Where the seatboards are adjacent to the perimeter, guard height shall be 42 inches (1067 mm) high minimum, measured from the seatboard.
fr_ca: Lorsque les bancs de sièges sont adjacents au périmètre, la hauteur du garde-corps doit être d’au moins 42 po (1 067 mm), mesurée à partir du banc de sièges.

source: Where the seats are self-rising, guard height shall be 42 inches (1067 mm) high minimum, measured from the floor surface.
fr_ca: Lorsque les sièges se relèvent automatiquement, la hauteur du garde-corps doit être d’au moins 42 po (1 067 mm), mesurée à partir de la surface du plancher.

source: Where the slopes of the planned finished grade measured between the entrance and all vehicular or pedestrian arrival points within 50 feet (15 240 mm) of the planned entrance are 10 percent or less.
fr_ca: Lorsque les pentes du niveau du sol fini prévu, mesurées entre l’entrée et tous les points d’arrivée des véhicules ou des piétons situés à moins de 50 pi (15 240 mm) de l’entrée prévue, sont de 10 % ou moins.

source: Where the slopes of the undisturbed site measured between the planned entrance and all vehicular or pedestrian arrival points within 50 feet (15 240 mm) of the planned entrance are 10 percent or less.
fr_ca: Lorsque les pentes du niveau du sol existant, mesurées entre l’entrée prévue et tous les points d’arrivée des véhicules ou des piétons situés à moins de 50 pi (15 240 mm) de l’entrée prévue, sont de 10 % ou moins.

source: Where the space beneath the permanent platform is used for storage or any purpose other than equipment, wiring or plumbing, the floor assembly shall be not less than 1-hour fire-resistance-rated construction.
fr_ca: Lorsque l’espace situé sous la plateforme permanente est utilisé pour l’entreposage ou à toute autre fin que l’installation d’équipement, de câblage ou de plomberie, l’assemblage de plancher doit être constitué d’une construction présentant une résistance au feu d’au moins 1 heure.

source: Where the space beneath the permanent platform is used only for equipment, wiring or plumbing, the underside of the permanent platform need not be protected.
fr_ca: Lorsque l’espace situé sous la plateforme permanente est utilisé uniquement pour l’installation d’équipement, de câblage ou de plomberie, la face inférieure de la plateforme permanente n’a pas à être protégée.

source: Where the stage height is greater than 50 feet (15 240 mm), all portions of the stage shall be completely separated from the seating area by a proscenium wall with not less than a 2-hour fire-resistance rating extending continuously from the foundation to the roof.
fr_ca: Lorsque la hauteur de la scène est supérieure à 50 pieds (15 240 mm), toutes les parties de la scène doivent être complètement séparées de l’aire de places assises par un mur de séparation de scène présentant une résistance au feu d’au moins 2 heures et s’étendant de façon continue des fondations jusqu’au toit.

source: Where the stairway has a straight run, the depth in the direction of travel shall be not less than 36 inches (914 mm).
fr_ca: Lorsque l'escalier est droit, la profondeur dans le sens de la marche ne doit pas être inférieure à 36 po [914 mm].

source: Where the stepped aisle is designed in accordance with Exception 1 of Section 1030.14.2.2, the stepped aisle shall be constructed so that each riser of unequal height, determined in the direction of descent, is not more than 3/8 inch (9.5 mm) in height different from adjacent risers where stepped aisle treads are less than 22 inches (560 mm) in depth and 3/4 inch (19.1 mm) in height different from adjacent risers where stepped aisle treads are 22 inches (560 mm) or greater in depth.
fr_ca: Lorsque l’allée à gradins est conçue conformément à l’exception 1 de la section 1030.14.2.2, elle doit être construite de manière que chaque contremarche de hauteur inégale, déterminée dans le sens de la descente, ne présente pas une différence de hauteur de plus de 3/8 po (9,5 mm) par rapport aux contremarches adjacentes lorsque les girons de l’allée à gradins ont une profondeur inférieure à 22 po (560 mm), et de plus de 3/4 po (19,1 mm) par rapport aux contremarches adjacentes lorsque les girons de l’allée à gradins ont une profondeur de 22 po (560 mm) ou plus.

source: Where the top rail is supported by glass, the assembly shall be tested according to the impact requirements of Section 1609.2.
fr_ca: Lorsque la lisse supérieure est supportée par du verre, l’ensemble doit être soumis à des essais conformément aux exigences relatives aux essais d’impact de la section 1609.2.

source: Where the total lavatories provided in a toilet room or bathing facility is six or more, at least one lavatory with enhanced reach ranges shall be provided.
fr_ca: Lorsque le nombre total de lavabos prévus dans un cabinet de toilette ou une salle de bain est de six ou plus, au moins un lavabo offrant des plages de portée améliorées doit être prévu.

source: Where the total number of parking spaces provided is four or less, identification of accessible parking spaces is not required.
fr_ca: Lorsque le nombre total de places de stationnement prévues est de quatre ou moins, l'identification des places de stationnement accessibles n'est pas requise.

source: Where the wall line is broken by a door, demarcation lines on walls shall continue across the face of the door or transition to the floor and extend across the floor in front of such door.
fr_ca: Lorsque la ligne sur le mur est interrompue par une porte, les lignes de démarcation sur les murs doivent se poursuivre sur la face de la porte ou passer au plancher et se prolonger sur le plancher devant cette porte.

source: Where the weight of lay-in ceiling panels, used as part of fire-resistance-rated floor/ceiling or roof/ceiling assemblies, is not adequate to resist an upward force of 1 pound per square foot (48 Pa), wire or other approved devices shall be installed above the panels to prevent vertical displacement under such upward force.
fr_ca: Lorsque le poids des panneaux de plafond suspendu amovibles, utilisés comme partie intégrante d’assemblages de plancher/plafond ou de couverture/plafond présentant une résistance au feu, n’est pas suffisant pour résister à une force ascendante de 1 livre par pied carré (48 Pa), des fils métalliques ou d’autres dispositifs approuvés doivent être installés au-dessus des panneaux afin d’empêcher leur déplacement vertical sous l’effet d’une telle force ascendante.

source: Where the winter design temperature in Table R301.2(1) is below 60°F (16°C), every dwelling unit shall be provided with heating facilities capable of maintaining a room temperature of not less than 68°F (20°C) at a point 3 feet (914 mm) above the floor and 2 feet (610 mm) from exterior walls in habitable rooms at the design temperature.
fr_ca: Lorsque la température de calcul hivernale indiquée dans le tableau R301.2(1) est inférieure à 60 °F (16 °C), chaque logement doit être équipé d'installations de chauffage capables de maintenir une température ambiante d'au moins 68 °F (20 °C) à un point situé à 3 pi (914 mm) au-dessus du sol et à 2 pi (610 mm) des murs extérieurs dans les pièces habitables à la température de calcul.

source: Where there are four or more dwelling units or sleeping units intended to be occupied as a residence in a single structure, every dwelling unit and every sleeping unit intended to be occupied as a residence shall be a Type B unit.
fr_ca: Lorsqu’un même bâtiment comporte quatre logements ou unités de couchage ou plus destinés à être occupés comme résidence, chaque logement et chaque unité de couchage destiné à être occupé comme résidence doit être une unité de type B.

source: Where there are four or more dwelling units or sleeping units intended to be occupied as a residence in a single structure, every dwelling unit and sleeping unit intended to be occupied as a residence shall be a Type B unit.
fr_ca: Lorsqu’un même bâtiment comporte quatre logements ou unités de couchage ou plus destinés à être occupés comme résidence, chaque logement et chaque unité de couchage destiné à être occupé comme résidence doit être une unité de type B.

source: Where there is an aisle between the seating and the perimeter, the guard height shall be measured in accordance with Section 1015.3.
fr_ca: Lorsqu’une allée est située entre les sièges et le périmètre, la hauteur du garde-corps doit être mesurée conformément à la section 1015.3.

source: Where there is no wall space on the latch side of a single door, or to the right side of double doors, signs shall be on the nearest adjacent wall.
fr_ca: Lorsqu'il n'y a pas d'espace mural du côté de la serrure d'une porte simple ou du côté droit de portes doubles, les enseignes doivent être placées sur le mur adjacent le plus proche.

source: Where there is seating on both sides of the aisle, the mid-aisle handrails shall be discontinuous.
fr_ca: Lorsqu'il y a des sièges des deux côtés de l'allée, les mains courantes au milieu de l'allée doivent être discontinues.

source: Where ticket offices or windows are provided, signs are not required at each assembly area provided that signs are displayed at each ticket office or window informing patrons of the availability of assistive listening systems.
fr_ca: Lorsque des billetteries ou des guichets sont prévus, des affiches ne sont pas requises dans chaque aire d’assemblée, pourvu que des affiches soient installées à chaque billetterie ou à chaque guichet pour informer les usagers de la disponibilité de systèmes d’aide à l’écoute.

source: Where tiered seating includes dining surfaces or work surfaces, wheelchair spaces and wheelchair space locations shall comply with Section 802.6, 802.7, 802.9, 802.10 and 902.
fr_ca: Lorsque les sièges en gradins comprennent des surfaces de restauration ou des surfaces de travail, les espaces pour fauteuils roulants et les emplacements des espaces pour fauteuils roulants doivent être conformes aux sections 802.6, 802.7, 802.9, 802.10 et 902.

source: Where tiered seating is provided, wheelchair space locations shall be integrated into the tiered seating area on a riser or a cross-aisle.
fr_ca: Lorsque des SIÈGES en gradins sont prévus, les emplacements pour fauteuils roulants doivent être intégrés à la zone de SIÈGES en gradins sur une contremarche ou dans une allée transversale.

source: Where toilet facilities are primarily for children’s use, required accessible water closets, toilet compartments and lavatories shall be permitted to comply with children’s provision of ICC A117.1.
fr_ca: Lorsque les installations sanitaires sont principalement destinées aux enfants, les cabines de toilette, les compartiments de toilette et les lavabos accessibles requis doivent pouvoir se conformer aux dispositions de la norme ICC A117.1 pour les enfants.

source: Where two adjacent wheelchair spaces are provided, each wheelchair space shall be 33 inches (840 mm) minimum in width.
fr_ca: Lorsque deux espaces adjacents pour fauteuils roulants sont prévus, chaque espace pour fauteuil roulant doit avoir une largeur minimale de 33 po [840 mm].

source: Where two handrails are required, one of the handrails shall be within 30 inches (762 mm) horizontally of the stepped aisle.
fr_ca: Lorsque deux mains courantes sont exigées, l’une d’elles doit se trouver à au plus 30 po (762 mm) horizontalement de l’allée à gradins.

source: Where two means of egress are required, the common path of travel shall be not greater than 100 feet (30 480 mm).
fr_ca: Lorsque deux moyens d’évacuation sont requis, la partie commune du parcours d’évacuation ne doit pas dépasser 100 pieds (30 480 mm).

source: Where two or more exits or exit access doorways from the stage are required in accordance with Section 1006.2, not fewer than one exit or exit access doorway shall be provided on each side of a stage.
fr_ca: Lorsqu’au moins deux issues ou baies de portes donnant accès à l’issue depuis la scène sont requises conformément à la section 1006.2, au moins une issue ou baie de porte donnant accès à l’issue doit être prévue de chaque côté de la scène.

source: Where visible doorbell signals are located in sleeping areas, controls shall be provided to deactivate the signal.
fr_ca: Lorsque des signaux visuels de sonnette sont installés dans des aires de couchage, des commandes permettant de désactiver le signal doivent être prévues.

source: Where walls are located to permit the installation of grab bars and seats complying with Section 604.5 at water closets; grab bars complying with Section 607.4 at bathtubs; and for grab bars and shower seats complying with Sections, 608.3, 608.2.1.3, 608.2.2.3 and 608.2.3.2 at shower compartments; reinforcement shall be provided for the future installation of grab bars and seats complying with those requirements.
fr_ca: Lorsque les murs sont situés de manière à permettre l'installation de barres d'appui et de sièges conformes à l'article 604.5 dans les cabines de toilette; de barres d'appui conformes à l'article 607.4 dans les baignoires; et de barres d'appui et de sièges de douche conformes aux articles 608.3, 608.2.1.3, 608.2.2.3 et 608.2.3.2 dans les compartiments de douche; il faut prévoir un renforcement pour l'installation future de barres d'appui et de sièges conformes à ces exigences.

source: Where wheelchair space locations provide lines of sight over the shoulder and between heads, spectators in wheelchair space locations shall be afforded lines of sight complying with Section 802.9.1.2.
fr_ca: Lorsque les emplacements pour fauteuils roulants offrent des lignes de visibilité par-dessus l'épaule et entre les têtes, les spectateurs dans les emplacements pour fauteuils roulants doivent bénéficier de lignes de visibilité conformes à la section 802.9.1.2.

source: Where winders are adjacent within a flight, the point of the widest clear stair width of the adjacent winders shall be used.
fr_ca: Lorsque les marches biseautées sont adjacentes dans une volée, il faut utiliser le point de la largeur libre la plus large des marches biseautées adjacentes.

source: Where:
fr_ca: Où :

source: Whirlpool bathtubs shall be installed and tested in accordance with the manufacturer’s instructions.
fr_ca: Les baignoires à remous doivent être installées et testées conformément aux directives du fabricant.

source: Whirlpool bathtubs shall comply with ASME A112.19.7/CSA B45.10 and shall be listed and labeled in accordance with UL 1795.
fr_ca: Les baignoires à remous doivent être conformes à la norme ASME A112.19.7/CSA B45.10 et doivent être répertoriées et étiquetées conformément à la norme UL 1795.

source: Width
fr_ca: Largeur

source: Winder treads shall have a tread depth of not less than 10 inches (254 mm) measured between the vertical planes of the foremost projection of adjacent treads at the intersections with the walkline.
fr_ca: Les marches balancées doivent avoir une profondeur de pas de marche d'au moins 10 po [254 mm], mesurée entre les plans verticaux de la saillie principale des marches adjacentes à l'intersection de la ligne de foulée.

source: Winder treads shall have a tread depth of not less than 6 inches (152 mm) at any point within the clear width of the stair.
fr_ca: Les marches balancées doivent avoir une profondeur de pas d'au moins 6 po [152 mm] en tout point de la largeur libre de l'escalier.

source: Window-opening control devices complying with ASTM F2090 shall be permitted for use on windows serving as a required emergency escape and rescue opening.
fr_ca: Les dispositifs de commande d’ouverture des fenêtres conformes à la norme ASTM F2090 peuvent être utilisés sur les fenêtres servant d’ouvertures d’évacuation d’urgence et de sauvetage requises.

source: Windows and doors within a bathtub enclosure shall conform to the safety glazing requirements of the International Building Code.
fr_ca: Les fenêtres et les portes à l'intérieur d'une cabine de baignoire doivent être conformes aux exigences en matière de verre de sécurité du Code International du Bâtiment.

source: Windows and doors within a shower enclosure shall conform to the safety glazing requirements of the International Building Code.
fr_ca: Les fenêtres et les portes d'une cabine de douche doivent être conformes aux exigences en matière de verre de sécurité du Code International du Bâtiment.

source: Windows in bathrooms shall not be required to comply with Section 1102.13.
fr_ca: Les fenêtres des salles de bain ne sont pas tenues de se conformer à la section 1102.13.

source: Windows in kitchens shall not be required to comply with Section 1102.13.
fr_ca: Les fenêtres des cuisines ne sont pas tenues de se conformer à la section 1102.13.

source: Windows in smoke partitions shall be sealed to resist the free passage of smoke or be automatic-closing upon detection of smoke.
fr_ca: Les fenêtres des cloisons pare-fumée doivent être scellées de manière à résister au passage libre de la fumée ou se fermer automatiquement dès la détection de fumée.

source: Windows shall be permitted to be fixed provided that glazing can be cleared by fire fighters.
fr_ca: Les fenêtres peuvent être fixes à condition que le vitrage puisse être dégagé par les pompiers.

source: Wired glass with wire exposed on longitudinal edges shall not be used in jalousies or louvered windows.
fr_ca: Le verre armé dont le fil est exposé sur les bords longitudinaux ne doit pas être utilisé dans les jalousies ou les fenêtres à persiennes.

source: Wired glass with wire exposed on longitudinal edges shall not be used in louvered windows or jalousies.
fr_ca: Le verre armé dont le fil est exposé sur les bords longitudinaux ne doit pas être utilisé dans les fenêtres à persiennes ou les jalousies.

source: Wiring shall be permanent and without a disconnecting switch other than that required for overcurrent protection.
fr_ca: Le câblage doit être permanent et sans sectionneur autre que celui qui est exigé pour la protection contre les surintensités.

source: Wiring shall be permanent and without a disconnecting switch other than those required for overcurrent protection.
fr_ca: Le câblage doit être permanent et sans sectionneur autre que ceux exigés pour la protection contre les surintensités.

source: Within any flight of stairs, the largest winder tread depth at the walkline shall not exceed the smallest winder tread by more than 3/8 inch (9.5 mm).
fr_ca: Dans toute volée de marches, la plus grande profondeur de marche balancée au niveau de la ligne de foulée ne doit pas dépasser la plus petite marche balancée de plus de 3/8 pouce (9,5 mm).

source: Within employee work areas, handrails shall not be required where ramps that are part of common use circulation paths, and which are used for the movement of equipment, are designed to permit the installation of handrails complying with Section 505.
fr_ca: Dans les zones de travail des employés, les rampes ne sont pas exigées lorsque les rampes qui font partie des voies de circulation à usage commun et qui sont utilisées pour le déplacement d'équipement sont conçues pour permettre l'installation de rampes conformes à l'article 505.

source: Within employee work areas, the required clear width of ramps that are a part of common use circulation paths shall be permitted to be decreased by work area equipment provided that the decrease is essential to the function of the work being performed.
fr_ca: Dans les zones de travail des employés, la largeur libre exigée des rampes qui font partie des voies de circulation à usage commun peut être réduite par l'équipement de la zone de travail, à condition que la réduction soit essentielle à la fonction du travail effectué.

source: Within the rear 60 percent of the seats provided; or
fr_ca: Dans les 60 pour cent arrière des sièges prévus; ou

source: Wood beams, joists, studs and other combustible material shall have a clearance of not less than 2 inches (51 mm) from the front faces and sides of masonry fireplaces and not less than 4 inches (102 mm) from the back faces of masonry fireplaces.
fr_ca: Les poutres en bois, les solives, les montants et les autres matériaux combustibles doivent avoir un dégagement d'au moins 2 po [51 mm] par rapport aux faces avant et aux côtés des foyers en maçonnerie et d'au moins 4 po [102 mm] par rapport aux faces arrière des foyers en maçonnerie.

source: Wood finish flooring is permitted to be attached directly to the embedded or fireblocked wood sleepers and shall be permitted where cemented directly to the top surface of fire-resistance-rated floor assemblies or directly to a wood subfloor attached to sleepers as provided for in Section 805.1.1.
fr_ca: Les revêtements de sol de finition en bois peuvent être fixés directement aux lambourdes en bois encastrées ou munies de dispositifs coupe-feu et sont également autorisés lorsqu’ils sont collés directement sur la surface supérieure d’assemblages de plancher cotés pour leur degré de résistance au feu ou directement sur un sous-plancher en bois fixé à des lambourdes, comme le prévoit la section 805.1.1.

source: Wood handrails shall be permitted for all types of construction.
fr_ca: Les rampes en bois sont autorisées pour tous les types de construction.
